<script setup>
</script>

<template>
    <div class="container mx-auto px-4 py-8">
        <div class="text-center">
            <h1 class="text-3xl font-bold  mb-3">🥠 使用條款</h1>
            <p class="text-gray-500 mb-4">請詳細閱讀以下使用條款。</p>
        </div>
        <section>
            <article class="bg-white rounded-lg p-6 boxShadow"> 
                <h2 class="text-xl font-bold mb-4">一、會員服務</h2>
                <p>
                    一旦本團隊完成並確認您的申請後，本團隊將提供您的會員服務內容有：評論、食記、個人專頁（Profile）或其他未來可能新增之會員服務。會員服務僅依當時所提供之功能及狀態提供服務；本團隊並保留新增、修改或取消會員服務內相關系統或功能之權利。<br><br>
                    會員服務之始期，係自使用者填妥申請資料並完成註冊程序後，本團隊於完成相關系統設定、使會員服務達於可供使用之日開始。如您有購買或使用付費服務，您必須及時提供購買流程中所要求之資料、為適切地為您提供相關服務所必須的資料，您並應擔保您所提供的所有資料，都是正確且即時的資料，如果您所留存的資料事後有變更，您應立即更新您所留存的資料。<br><br>
                    因會員服務所提供之所有相關網域名稱、網路位址、功能以及其他一切因會員身分得使用之權益，均仍屬本團隊或其他合法權利人所有，會員僅得於服務期間內依本服務條款之約定為使用，不得以任何方式將其會員權益轉讓、移轉、出租或出借予其他任何第三人。
                </p>

                <h2 class="text-xl font-bold mt-6 mb-4">二、資料空間與儲存</h2>
                <p>
                    本團隊保留新增或修改儲存空間大小之權利。本系統不擔保您所上載的資料將被正常顯示、亦不擔保資料傳輸的正確性；如果您發現本系統有錯誤或疏失，請立即通知本團隊。
                </p>

                <h2 class="text-xl font-bold mt-6 mb-4">三、帳號、密碼與安全性</h2>
                <p>
                    在您使用會員服務以前，必須經過本團隊所訂的註冊手續，在註冊過程中您必須填入完整、而且正確的資料。如因資料錯誤或未更新所造成的任何問題，您須自行負擔責任。<br><br>
                    對於您所取得的使用者名稱和密碼，您必須負妥善保管和保密的義務，並應為使用此使用者名稱和密碼登入後於本網站之一切行為負責。建議於使用完畢後確實登出，並請勿轉讓、出借予第三者使用，如果您的這個使用者名稱和密碼被其他人冒用或不當使用，本團隊會儘速協助您解決，但不對您負有任何形式之賠償或補償之責任或義務。
                </p>

                <h2 class="text-xl font-bold mt-6 mb-4">四、使用者的行為</h2>
                <p>
                    您必須遵守相關法令規範，且您同意不從事以下的行為：<br> 
                    (1) 刊載、傳輸、發送或儲存任何誹謗、詐欺、傷害、猥褻、色情、賭博、謾罵、不實或其他一切違反中華民國法令之檔案或資料。<br>
                    (2) 刊載、傳輸、發送或儲存任何侵害他人智慧財產權或其他權益的資料。<br>
                    (3) 未經同意擅自摘錄或使用會員服務內任何資料庫內容之全部或一部，包括但不限於使用爬蟲程式抓取 JiaBaMap 頁面上之資料。<br>
                    (4) 刊載、傳輸、發送、儲存病毒、或其他任何足以破壞或干擾電腦系統或資料的程式或訊息。<br>
                    (5) 破壞或干擾會員服務的系統運作或違反一般網路禮節之行為。<br>
                    (6) 在未經授權下進入會員服務系統或冒用他人帳號或偽造他人辨識資料。<br>
                    (7) 任何竊取會員服務之會員帳號、密碼或存取權限之行為。<br>
                    (8) 任何妨礙或干擾其他使用者使用會員服務之行為。<br>
                    (9) 其他不符合會員服務所提供的使用目的之行為。<br>
                    (10) 破壞及干擾本服務所提供之各項 資料、活動或功能，或以任何方式侵入、試圖侵入、破壞本服務之任何系統，或藉由本服務為任何侵害或破壞行為。
                    (11) 從事不法交易行 為或刊載引人犯罪之訊息或買賣行為。<br><br>

                    會員服務內之各類文字、圖檔、圖片及其他著作或資料，其著作權或其他相關智慧財產權均仍屬於合法權利人所有，由合法權利人依照當時所定之授權條件及範圍授權會員使用，但僅限於您個人於 JiaBaMap 網站上使用，未經事前授權您不可以將這些文字、圖檔、圖片或其他著作或資料為重製、公開口述、公開播送、公開上映、公開演出、公開傳輸、改作、散布、發行、公開發表、銷售、轉讓、出租、出借、轉授權、隨書附贈或其他任何形式的使用，亦不得上載於其他任何網站、或以其他方式提供予其他人使用。<br>

                    本團隊不保證針對會員所傳送、張貼或發表之內容做任何形式或實質之審查，如果任何文字、圖檔、圖片或其他著作或資料發生權利歸屬或其他合法性爭議，本團隊有權隨時不經通知，直接停止提供會員服務、或直接刪除該文字、圖檔、圖片或其他著作或資料、或通知會員停止使用會員服務。<br>

                    如您認為 JiaBaMap 中之任何網頁內容或其他會員使用 JiaBaMap 服務已侵害您的著作權，請您至 JiaBaMap 客服中心與客服人員聯繫，客服人員將會儘速為您處理。<br>

                    若有發現任何色情、侮辱、誹謗等不合規定的圖片，本團隊將立即刪除，並砍除帳號，不另通知。

                </p>

                <h2 class="text-xl font-bold mt-6 mb-4">五、責任限制</h2>
                <p>
                    對於本團隊所提供之各項會員服務，均僅依該服務當時之功能及現況提供使用；對於使用者之特定要求或需求，包括但不限於速度、安全性、可靠性、完整性、正確性及不會斷線和出錯等，本團隊不負任何形式或內容之擔保或保證責任。<br>
                    對於您所上傳的圖片或文字等資料，您應自行判斷是否適宜公開傳送至網站上，本團隊會盡最大努力保證您資料的安全性，但無法保證任檔案或資料於傳送過程均係可靠且正確無誤，亦不保證所儲存的檔案或資料之安全性、可靠性、完整性、正確性及不會斷線和出錯等。<br>
                    對於您於本服務中所下載之電子郵件、檔案及其他資料，您應該自行考量其風險，如因下載而造成您電腦系統的損壞或電腦中資料的遺失，本團隊不負任何擔保責任。<br>
                    在本服務中，由您及其他會員上載、公開傳輸、公開發表或私下傳送的資訊、資料、文字、軟體、音樂、音訊、照片、圖形、視訊、信息或其他資料（以下簡稱「使用者內容」），均由「使用者內容」的提供者自負責任。本服務無法控制經由本服務而張貼之「使用者內容」，因此不保證其正確性、完整性或品質。您了解使用本服務時，可能會接觸到令人不快或厭惡的「使用者內容」。在任何情況下， JiaBaMap 均不為任何「使用者內容」負責，包含但不限於任何錯誤或遺漏，以及經由本服務張貼、發送電子郵件或傳送而衍生之任何損失或損害。<br>
                    會員所上傳之文字、圖檔、圖片及其他著作或資料等「使用者內容」，自上傳當下即視為授權於 JiaBaMap 相關服務中顯示，可由本團隊人工或程式整理、編輯、翻譯呈現於網站及應用程式之中。
                </p>

                <h2 class="text-xl font-bold mt-6 mb-4">六、智慧財產權的保護</h2>
                <p>
                     JiaBaMap 所使用之軟體或程式、網站上所有內容，包括但不限於圖片、文字、資料、網站架構、網站網頁設計、會員內容等，均由 JiaBaMap 或其他權利人依法擁有其智慧財產權，包括但不限於商標權、專利權、著作權、營業秘密與專有技術等。<br>
                    尊重智慧財產權是應盡義務，如有違反，您應對 JiaBaMap 負損害賠償責任。任何人不得擅自使用、重製、公開傳輸、散布、發行、公開發表、進行還原工程、解編或反向組譯。若您欲引用或轉載前述程式或內容，除明確為法律所許可者外，必須依法取得 JiaBaMap 或其他製作權擁有者之事前書面同意。
                </p>

                <h2 class="text-xl font-bold mt-6 mb-4">七、服務暫停或中斷</h2>
                <p>
                    會員服務系統或功能『例行性』之維護、改置或變動所發生之服務暫停或中斷，本團隊將於該暫停或中斷前以電子郵件、公告或其他適當之方式告知會員，您同意本團隊不須因此負損害賠償責任。 在下列情形，本團隊將暫停或中斷本服務之全部或一部，且對使用者任何直接或間接之損害，均不負任何責任：<br><br>
                    (1) 對本服務相關軟硬體設備進行搬遷、更換、升級、保養或維修時<br>
                    (2) 使用者有任何違反政府法令或本服務條款情形<br>
                    (3) 天災或其他不 可抗力所致之服務停止或中斷<br>
                    (4) 任何不可歸責於本團隊之事由所致之服務停止或中斷。
                </p>

                <h2 class="text-xl font-bold mt-6 mb-4">八、終止服務</h2>
                <p>
                    基於團隊的運作，會員服務有可能停止提供服務之全部或一部，使用者不可以因此而要求任何賠償或補償。<br>
                    如果您違反了本服務條款，本團隊保留隨時暫時停止提供服務、或終止提供服務之權利，您不可以因此而要求任何賠償或補償。<br>
                    您同意如果您在會員服務上所刊載、傳輸、發送或儲存的檔案或資料，有任何違反法令、違反本服務條款、或有侵害第三人權益之情事者，本團隊得隨時得不經通知直接加以移動、刪除或停止服務提供之權利，且不負損害賠償責任。若本團隊因此受到任何損害，您應對本團隊負損害賠償之責。<br>
                    會員服務系統會自動偵測沒有使用的會員帳號，如連續超過一年均未使用，系統將自動將您於該帳號內之所有檔案、資料及使用設定資料檔全數刪除且不予另行備份，並將您的會員帳號暫停使用。上述有無使用之紀錄，均以本團隊會員服務系統內所留存之紀錄為準。
                </p>

                <h2 class="text-xl font-bold mt-6 mb-4">九、準據法及管轄權</h2>
                <p>
                    本服務條款解釋、補充及適用均以中華民國法令為準據法。<br>
                    因本服務條款所發生之訴訟，以台灣台北地方法院為第一審管轄法院。
                </p>
            </article>
        </section>
    </div>
</template>

<style>
.boxShadow{
    box-shadow: rgba(0, 0, 0, 0.2) 0px 0px 25px;
}
</style>